---
kind: property
id: P:Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs.Document
zh: 文档、文件
source: html/ccbc5e47-3964-cf1e-4cac-fa023d3b8e63.htm
---
# Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs.Document Property

**中文**: 文档、文件

The document associated with the event.

## Syntax (C#)
```csharp
public Document Document { get; }
```